{"pages":[{"text":"\n\n\nSearch - Reeher-Palmer\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nToggle navigation\n\n\n\n\n\nReeher-Palmer            \n\n\n\n\n                             Reeher-Palmer Wedding 2018\n                          \n\n                             Wedding RSVP Form\n                          \n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n©  Reeher-Palmer\n            · Powered by pelican-bootstrap3,\n            Pelican,\n            Bootstrap \n Back to top\n\n\n\n\n\n\n\n\n\n\n\n    $(document).ready(function() {\n      $('#tipue_search_input').tipuesearch({\n        'mode' : 'json',\n        'show': 10,\n        'newWindow': false,\n        'contentLocation': 'tipuesearch_content.json'\n      });\n    });\n    \n\n","title":"Search - Reeher-Palmer\n","url":"https://reeher-palmer.net/search.html","tags":""},{"text":"We're so excited to see you at our wedding! Most of the wedding celebrations will be in St. Paul, aside from the ceremony. It's easy to get to and from the Minneapolis-St. Paul airport by public transit . Several nearby hotels include: The Saint Paul Hotel Hilton DoubleTree St. Paul Downtown Holiday Inn We welcome and encourage photography during our wedding ceremony and reception - but no flash, please! Any photos you take, we'd love to see a copy of! Please email us with them @ wedding@reeher-palmer.net Wedding Ceremony The wedding ceremony will be held at St. Mark's Episcopal Cathedral . Ceremony Location To enter the Cathedral, you can go up the stairs to enter the front of the Cathedral through the big main doors that face Oak Grove Street and Loring Park. Alternatively, you can enter through the office door on the east side of the building, off the parking lot and facing out to Oak Grove Street and Loring Park. This entry has many fewer stairs! Parking & Construction The church's main parking lot is available at Oak Grove Street and 15th Street. For further details on parking, see St. Mark's website . Currently, there is a large construction project impacting I-35W and I-94 . Accessibility You can find a fuller description of St. Mark's accessibility on the Cathedral's website . Reception [ 2:00PM - 8:00PM ] The reception will be at Bad Weather Brewery and starts at 2pm. Around 4PM, there will be a brewery tour if you're interested. Menu The menu will include vegan, vegetarian, and gluten-free options. We're currently planning on catering from Holy Land . We will have a wide array of drinks, including Bad Weather's artisinal sodas, lemonade, and caffinated beverages of various sorts. We will also have various Bad Weather Brewing beers. Wedding Registry You can find us registered at: Amazon Food52 For reference, our Fiestaware colors are turquoise and claret .","title":"Reeher-Palmer Wedding 2018","url":"pages/reeher-palmer-wedding-2018.html","tags":"pages"},{"text":"Please use the following embeded Google Form to RSVP, or fill it out directly . Loading...","title":"Wedding RSVP Form","url":"pages/wedding-rsvp-form.html","tags":"pages"}]}